cf_billing/InformationRegisters/бестФормулыРасчетаТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестФормулыРасчетаТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределенияОстатка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьИндивидуальноеПотребление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаПриВыходеПУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентДолевогоРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СторнироватьОбъемИндивидуальногоПотребления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированныйОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорнойКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранзитИзРазныхРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетаСубабонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчетаСубабонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаСубабонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АбонентСубабонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаПриВыводеПодчиненногоПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДоговорыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДоговорыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестФормулыРасчетаТочекУчетаНП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция - Возвращает формулу расчета головной ТУ
//
// Параметры:
//  Период			 - Дата 
//  Организация		 - СправочникСсылка.Организации
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  ОбъектРасчета	 - СправочникСсылка.бестОбъектыРасчета
//  Услуга			 - СправочникСсылка.энргВидыУслуг
//  ГоловнаяТУ		 - СправочникСсылка.энргТочкиУчета 
//
Функция ФормулаРасчетаГоловнойТУ(Период, Организация, Район, ОбъектРасчета, Услуга, ГоловнаяТУ) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента КАК ОбъектРасчета,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ТочкаУчетаСубабонента КАК ТочкаУчета,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УслугаСубабонента КАК Услуга,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СхемаПриВыводеПодчиненногоПУ КАК СхемаПриВыводеПодчиненногоПУ,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Коэффициент КАК Коэффициент,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Актуальность КАК Актуальность,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СпособРаспределения КАК СпособРаспределения,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СпособРаспределенияОстатка КАК СпособРаспределенияОстатка,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УчитыватьИндивидуальноеПотребление КАК УчитыватьИндивидуальноеПотребление,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ФиксированныйОбъем КАК ФиксированныйОбъем,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ДоговорнойКоэффициент КАК ДоговорнойКоэффициент
	               |ПОМЕСТИТЬ ВТ_ФормулыТУ
	               |ИЗ
	               |	РегистрСведений.бестФормулыРасчетаТочекУчетаНП.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И ОбъектРасчета = &ОбъектРасчета
	               |				И Услуга = &Услуга
	               |				И ГоловнаяТочкаУчета = &ГоловнаяТУ) КАК бестФормулыРасчетаТочекУчетаНПСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	               |	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК Услуга,
	               |	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	               |ПОМЕСТИТЬ ВТ_ДоговорыТУ
	               |ИЗ
	               |	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И (ОбъектРасчета, ТочкаУчета, Услуга) В
	               |					(ВЫБРАТЬ
	               |						ВТ_ФормулыТУ.ОбъектРасчета КАК ОбъектРасчета,
	               |						ВТ_ФормулыТУ.ТочкаУчета КАК ТочкаУчета,
	               |						ВТ_ФормулыТУ.Услуга КАК Услуга
	               |					ИЗ
	               |						ВТ_ФормулыТУ КАК ВТ_ФормулыТУ)) КАК бестДоговорыТочекУчетаСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ФормулыТУ.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВТ_ФормулыТУ.ТочкаУчета КАК ТочкаУчета,
	               |	ВТ_ФормулыТУ.Услуга КАК Услуга,
	               |	ВТ_ФормулыТУ.СхемаПриВыводеПодчиненногоПУ КАК СхемаПриВыводеПодчиненногоПУ,
	               |	ВТ_ФормулыТУ.Коэффициент КАК Коэффициент,
	               |	ВТ_ФормулыТУ.Актуальность КАК Актуальность,
	               |	ВТ_ФормулыТУ.СпособРаспределения КАК СпособРаспределения,
	               |	ВТ_ФормулыТУ.СпособРаспределенияОстатка КАК СпособРаспределенияОстатка,
	               |	ВТ_ФормулыТУ.УчитыватьИндивидуальноеПотребление КАК УчитыватьИндивидуальноеПотребление,
	               |	ВТ_ФормулыТУ.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	               |	ВТ_ФормулыТУ.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	               |	ВТ_ФормулыТУ.ФиксированныйОбъем КАК ФиксированныйОбъем,
	               |	ВТ_ФормулыТУ.ДоговорнойКоэффициент КАК ДоговорнойКоэффициент,
	               |	ВТ_ДоговорыТУ.Договор КАК Договор
	               |ИЗ
	               |	ВТ_ФормулыТУ КАК ВТ_ФормулыТУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоговорыТУ КАК ВТ_ДоговорыТУ
	               |		ПО ВТ_ФормулыТУ.ОбъектРасчета = ВТ_ДоговорыТУ.ОбъектРасчета
	               |			И ВТ_ФормулыТУ.ТочкаУчета = ВТ_ДоговорыТУ.ТочкаУчета
	               |			И ВТ_ФормулыТУ.Услуга = ВТ_ДоговорыТУ.Услуга";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("ГоловнаяТУ", ГоловнаяТУ);
	
	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#КонецЕсли
